app/views/user_orders/_form.html.erb

SELECT payment_type FROM `payment_types`
---
    <%= f.label :user_pay_type, "Pay with: " %>
    <%= f.select :user_pay_type, UserOrder::PAYMENT_TYPES, :prompt => "Please select payment method" %>