app/controllers/auth_users_controller.rb

SELECT `auth_users`.* FROM `auth_users` ORDER BY user_name
---
  def index
#    @auth_users = AuthUser.all
    @auth_users = AuthUser.order(:user_name)

SELECT `auth_users`.* FROM `auth_users` WHERE `auth_users`.`id` = 980190962 LIMIT 1
---
  def show
    @auth_user = AuthUser.find(params[:id])

SELECT `auth_users`.* FROM `auth_users` WHERE `auth_users`.`id` = 980190962 LIMIT 1
---
  def edit
    @auth_user = AuthUser.find(params[:id])

INSERT INTO `auth_users` (`user_name`, `created_at`, `enc_pass`, `pass_salt`, `updated_at`) VALUES ('Max', '2012-05-16 16:45:46', 'cfb247068f75e6e365ebef6a0569f17996f3a67e55dc6db76b44e439404842ee', '-6157324480.00800847251793102', '2012-05-16 16:45:46')
---
  def create
    @auth_user = AuthUser.new(params[:auth_user])

    respond_to do |format|
      if @auth_user.save

SELECT `auth_users`.* FROM `auth_users` WHERE `auth_users`.`id` = 980190962 LIMIT 1
UPDATE `auth_users` SET `user_name` = 'Max', `updated_at` = '2012-05-15 21:23:31', `enc_pass` = '98ecc32a313adac90c26e58979460c1ad2718d0c5f5c89919426768b5c4fddcb', `pass_salt` = '-6171596080.0989316326324571' WHERE `auth_users`.`id` = 980190962
---
  def update
    @auth_user = AuthUser.find(params[:id])

    respond_to do |format|
      if @auth_user.update_attributes(params[:auth_user])

SELECT `auth_users`.* FROM `auth_users` WHERE `auth_users`.`id` = 980190962 LIMIT 1
DELETE FROM `auth_users` WHERE `auth_users`.`id` = 980190962
---
  def destroy
    @auth_user = AuthUser.find(params[:id])
    @auth_user.destroy