app/controllers/auth_sessions_controller.rb

  def create
    if user = AuthUser.authenticate(params[:user_name], params[:user_password])
      session[:auth_user_id] = user.id
      session[:auth_user_name] = params[:user_name]
      redirect_to admin_url
    elsif AuthUser.count.zero?
---
SELECT COUNT(*) FROM `auth_users`