app/controllers/auth_admin_controller.rb

  def index
    @total_orders = UserOrder.count
---
SELECT COUNT(*) FROM `user_orders`