app/controllers/my_store_controller.rb

  def index
    @my_test_scaffolds = MyTestScaffold.all
---
SELECT `my_test_scaffolds`.* FROM `my_test_scaffolds` ORDER BY title