app/controllers/my_test_scaffolds_controller.rb

  def index
    @my_test_scaffolds = MyTestScaffold.all
---
SELECT `my_test_scaffolds`.* FROM `my_test_scaffolds` ORDER BY title

  def show
    @my_test_scaffold = MyTestScaffold.find(params[:id])
---
SELECT `my_test_scaffolds`.* FROM `my_test_scaffolds` WHERE `my_test_scaffolds`.`id` = 2 ORDER BY title LIMIT 1

  def edit
    @my_test_scaffold = MyTestScaffold.find(params[:id])
---
SELECT `my_test_scaffolds`.* FROM `my_test_scaffolds` WHERE `my_test_scaffolds`.`id` = 2 ORDER BY title LIMIT 1

  def create
    @my_test_scaffold = MyTestScaffold.new(params[:my_test_scaffold])

    respond_to do |format|
      if @my_test_scaffold.save
---
INSERT INTO `my_test_scaffolds` (`title`, `description`, `price`, `created_at`, `updated_at`, `image_file_name`, `image_content_type`, `image_file_size`, `image_updated_at`) VALUES ('Fifty Shades of Grey: Book One of the Fifty Shades Trilogy', 'When literature student Anastasia Steele goes to interview young entrepreneur Christian Grey, she encounters a man who is beautiful, brilliant, and intimidating. The unworldly, innocent Ana is startled to realize she wants this man and, despite his enigmatic reserve, finds she is desperate to get close to him. Unable to resist Ana’s quiet beauty, wit, and independent spirit, Grey admits he wants her, too—but on his own terms.', 9.99, '2012-06-27 18:22:45', '2012-06-27 18:22:45', 'grey.jpg', 'image/jpeg', 17747, '2012-06-27 18:22:45')

  def update
    @my_test_scaffold = MyTestScaffold.find(params[:id])

    respond_to do |format|
      if @my_test_scaffold.update_attributes(params[:my_test_scaffold])
---
SELECT `my_test_scaffolds`.* FROM `my_test_scaffolds` WHERE `my_test_scaffolds`.`id` = 2 ORDER BY title LIMIT 1
UPDATE `my_test_scaffolds` SET `description` = 'Ruby is the fastest growing and most exciting dynamic language out there. If you need to get working programs delivered fast, you should add Ruby to your toolbox.\r\n ', `image_file_name` = 'ruby.jpg', `image_content_type` = 'image/jpeg', `image_file_size` = 8300, `image_updated_at` = '2012-06-27 18:10:01', `updated_at` = '2012-06-27 18:10:01' WHERE `my_test_scaffolds`.`id` = 1

  def destroy
    @my_test_scaffold = MyTestScaffold.find(params[:id])
    @my_test_scaffold.destroy
---
SELECT `my_test_scaffolds`.* FROM `my_test_scaffolds` WHERE `my_test_scaffolds`.`id` = 4 ORDER BY title LIMIT 1
DELETE FROM `my_test_scaffolds` WHERE `my_test_scaffolds`.`id` = 4

  def who_bought_this
    @my_test_scaffold = MyTestScaffold.find(params[:id])
---
SELECT `my_test_scaffolds`.* FROM `my_test_scaffolds` WHERE `my_test_scaffolds`.`id` = 1 ORDER BY title LIMIT 1