app/controllers/resque_que_controller.rb

SELECT `resque_ques`.* FROM `resque_ques`
---
  def index
    Resque.enqueue(BgPrint, Time.now)
    @printed = ResqueQue.all