app/controllers/shop_items_controller.rb

  def index
    @shop_items = ShopItem.all
---
SELECT `shop_items`.* FROM `shop_items`

  def show
    @shop_item = ShopItem.find(params[:id])
---
SELECT `shop_items`.* FROM `shop_items` WHERE `shop_items`.`id` = 980190962 LIMIT 1

  def edit
    @shop_item = ShopItem.find(params[:id])
---
SELECT `shop_items`.* FROM `shop_items` WHERE `shop_items`.`id` = 980190962 LIMIT 1

  def create
    @shop_item = ShopItem.new(params[:shop_item])

    @shop_cart = current_shop_cart # method in application_controller.rb
    my_test_scaffold = MyTestScaffold.find(params[:my_test_scaffold_id])
#    @shop_item = @shop_cart.shop_items.build(:my_test_scaffold => my_test_scaffold)
    # ShopCart has many ShopItems, i.e. ShopItem has field shop_cart_id
    # .build adds record to :has_many releationship before save
    @shop_item = @shop_cart.add_test_scaffold(my_test_scaffold.id)

    respond_to do |format|
      if @shop_item.save
---
SELECT `my_test_scaffolds`.* FROM `my_test_scaffolds` WHERE `my_test_scaffolds`.`id` = 980190962 ORDER BY title LIMIT 1
INSERT INTO `shop_carts` (`updated_at`, `created_at`) VALUES ('2012-01-05 17:45:46', '2012-01-05 17:45:46')
INSERT INTO `shop_items` (`user_order_id`, `updated_at`, `shop_cart_id`, `my_test_scaffold_id`, `quantity`, `created_at`) VALUES (NULL, '2012-05-09 14:49:40', 980190963, 980190962, 1, '2012-05-09 14:49:40')

  def update
    @shop_item = ShopItem.find(params[:id])
---
SELECT `shop_items`.* FROM `shop_items` WHERE `shop_items`.`id` = 980190962 LIMIT 1

  def destroy
    @shop_item = ShopItem.find(params[:id])

    @shop_item.quantity -= 1
    if @shop_item.quantity == 0
      @shop_item.destroy
    else
      @shop_item.save
---
SELECT `shop_items`.* FROM `shop_items` WHERE `shop_items`.`id` = 980190962 LIMIT 1
DELETE FROM `shop_items` WHERE `shop_items`.`id` = 980190962
UPDATE `shop_items` SET `updated_at` = '2012-01-05 18:44:53', `quantity` = 1 WHERE `shop_items`.`id` = 53