app/controllers/shop_carts_controller.rb

SELECT `shop_carts`.* FROM `shop_carts`
---
  def index
    @shop_carts = ShopCart.all

SELECT `shop_carts`.* FROM `shop_carts` WHERE `shop_carts`.`id` = 980190962 LIMIT 1
---
  def show
    begin
      @shop_cart = ShopCart.find(params[:id])

SELECT `shop_carts`.* FROM `shop_carts` WHERE `shop_carts`.`id` = 980190962 LIMIT 1
---
  def edit
    @shop_cart = ShopCart.find(params[:id])

INSERT INTO `shop_carts` (`updated_at`, `created_at`) VALUES ('2011-12-31 18:04:19', '2011-12-31 18:04:19')
---
  def create
    @shop_cart = ShopCart.new(params[:shop_cart])

    respond_to do |format|
      if @shop_cart.save

SELECT `shop_carts`.* FROM `shop_carts` WHERE `shop_carts`.`id` = 980190962 LIMIT 1
---
  def update
    @shop_cart = ShopCart.find(params[:id])

SELECT `shop_carts`.* FROM `shop_carts` WHERE `shop_carts`.`id` = 980190962 LIMIT 1
DELETE FROM `shop_carts` WHERE `shop_carts`.`id` = 980190962
---
  def destroy
    @shop_cart = ShopCart.find(params[:id])
    @shop_cart.destroy