app/controllers/user_orders_controller.rb

SELECT COUNT(*) FROM `user_orders`
SELECT `user_orders`.* FROM `user_orders` ORDER BY created_at desc LIMIT 4 OFFSET 0
---
  def index
#    @user_orders = UserOrder.all
    @user_orders = UserOrder.paginate :page => params[:page], :order => 'created_at desc', :per_page => 4

SELECT `user_orders`.* FROM `user_orders` WHERE `user_orders`.`id` = 980190962 LIMIT 1
---
  def show
    @user_order = UserOrder.find(params[:id])

SELECT COUNT(*) FROM `shop_items` WHERE (`shop_items`.shop_cart_id = 980190968)
SELECT `shop_items`.* FROM `shop_items` WHERE (`shop_items`.shop_cart_id = 980190970)
---
  def new
    if current_shop_cart.shop_items.empty?

SELECT `user_orders`.* FROM `user_orders` WHERE `user_orders`.`id` = 980190962 LIMIT 1
---
  def edit
    @user_order = UserOrder.find(params[:id])

INSERT INTO `shop_carts` (`updated_at`, `created_at`) VALUES ('2012-01-18 20:08:47', '2012-01-18 20:08:47')
INSERT INTO `user_orders` (`user_pay_type`, `updated_at`, `created_at`, `user_email`, `user_name`, `user_address`) VALUES ('#<PaymentType:0xb68619cc>', '2012-05-09 15:38:21', '2012-05-09 15:38:21', 'e-xormail@tut.by', 'Max S', '1234 Peachtree str.')
DELETE FROM `shop_carts` WHERE `shop_carts`.`id` = 980190969
---
  def create
    @user_order = UserOrder.new(params[:user_order])
    @user_order.add_shop_items_from_user_cart(current_shop_cart)

    respond_to do |format|
      if @user_order.save
        ShopCart.destroy(session[:shop_cart_id])

SELECT `user_orders`.* FROM `user_orders` WHERE `user_orders`.`id` = 980190962 LIMIT 1
---
  def update
    @user_order = UserOrder.find(params[:id])

SELECT `user_orders`.* FROM `user_orders` WHERE `user_orders`.`id` = 980190962 LIMIT 1
DELETE FROM `user_orders` WHERE `user_orders`.`id` = 980190962
---
  def destroy
    @user_order = UserOrder.find(params[:id])
    @user_order.destroy